---
title: CategoryNameMap
classe: Autodesk.Revit.DB.CategoryNameMap
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# CategoryNameMap

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `categoryNameMap.IsEmpty` | Boolean |
| `Category Item { get; set; }` | `categoryNameMap.Item` | Category |
| `Int32 Size { get; }` | `categoryNameMap.Size` | Int32 |
| `Void Clear()` | `categoryNameMap.Clear()` | Void |
| `Boolean Contains(String)` | `categoryNameMap.Contains(key)` | Boolean |
| `Int32 Erase(String)` | `categoryNameMap.Erase(key)` | Int32 |
| `CategoryNameMapIterator ForwardIterator()` | `categoryNameMap.ForwardIterator()` | CategoryNameMapIterator |
| `IEnumerator GetEnumerator()` | `categoryNameMap.GetEnumerator()` | IEnumerator |
| `Boolean Insert(String, Category)` | `categoryNameMap.Insert(key, item)` | Boolean |
| `CategoryNameMapIterator ReverseIterator()` | `categoryNameMap.ReverseIterator()` | CategoryNameMapIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```